
IDENTIFICATION DIVISION.
PROGRAM-ID. Untitled-1.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

PROCEDURE DIVISION.


STOP RUN.